class User
{
    constructor(firstName, lastName, avatar = "./images/Icons/avatar.png", landmarks = [])
    {
        this.firstName = firstName;
        this.lastName = lastName;
        this.avatar = avatar;
        this.landmarks = landmarks;
    }
}

class Landmark
{
    constructor(name, place, photo, about, path = "./pages/content.html", author)
    {
        this.name = name;
        this.place = place;
        this.photo = photo;
        this.about = about
        this.path = path
        this.author = author
    }
}

var landmarks =  [ 
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
    new Landmark("الكعبة المشرفة", "مكة المكرمة", "./images/السياحه-في-السعودية-1.jpg", "الكعبة المشرفة هي قبلة المسلمين في صلواتهم، وحولها يطوفون أثناء أداء فريضة الحج، كما أنها أول بيت يوضع في الأرض وفق المُعتقد الإسلامي، ولا يمكن ذكر المسجد الحرام دون ذكر الكعبة، إذ يبدأ تاريخ المسجد بتاريخ بناء الكعبة المشرفة.",),
]